# coding: utf-8
# PEP-8

# Задача-1: поработайте с переменными, создайте несколько,
# выведите на экран, запросите от пользователя и сохраните в переменную, выведите на экран

print("Hello world!\nThis is my first task on GeekBrain's python course!")
name = input("Dear friend, type your name here: ")
print("Glad to see you here,", name)
